Repository: oxygenxml/Fluenta
Catalog: docs/XLIFF/fluenta_*.ditamap.xlf
Languages: es

source: Introduction
es: Introducción

source: Fluenta is a tool designed to simplify the translation of DITA projects. It can parse a DITA map, resolving the references to all topics and subtopics, preparing a unified {ph0}XLIFF{ph1} file that you can send to your {ph2}Language Service Provider{ph3} (LSP).
es: Fluenta es una herramienta diseñada para simplificar la traducción de proyectos DITA. Puede analizar un mapa DITA, resolviendo las referencias a todos los temas y subtemas, preparando un archivo {ph0}XLIFF{ph1} unificado que puede enviar a su {ph2}Proveedor de Servicios Lingüísticos{ph3} (PSL).

source: Fluenta implements the procedure for translating DITA projects recommended by the {ph0}OASIS DITA Adoption TC{ph1}.
es: Fluenta aplica el procedimiento de traducción de proyectos DITA recomendado por el {ph0}OASIS DITA Adoption TC{ph1}.

source: How it works
es: Cómo Funciona

source: Start by {ph0}creating a project{ph1}. All you have to do is provide the location of your DITA map and select the languages that you want to translate into.
es: Empiece por {ph0}crear un proyecto{ph1}. Todo lo que tiene que hacer es proporcionar la ubicación de su mapa DITA y seleccionar los idiomas a los que desea traducir.

source: When you are ready to translate your project, {ph0}generate an XLIFF file{ph1} from it.
es: Cuando esté listo para traducir su proyecto, {ph0}genere un archivo XLIFF{ph1} a partir de él.

source: Send the XLIFF file to your {ph0}Language Service Provider{ph1} (LSP) and wait for a translated XLIFF.
es: Envíe el archivo XLIFF a su {ph0}Proveedor de Servicios Lingüísticos{ph1} (PSL) y espere un XLIFF traducido.

source: {ph0}Import the translated XLIFF{ph1} and select a folder where to store the translated version of your map and topics.
es: {ph0}Importe el archivo XLIFF{ph1} traducido y seleccione una carpeta donde almacenar la versión traducida de su mapa y contenidos.

source: The four steps described above are all you need to get a translated version of your DITA project. The following diagram shows the processes involved:
es: Los cuatro pasos descriptos anteriormente son todo lo que necesita para obtener una versión traducida de su proyecto DITA. El siguiente diagrama muestra los procesos implicados:

source: Translation Cycle
es: Ciclo de Traducción

source: After updating your DITA content, you may want to update the translations of your project. All you have to do at this moment is:
es: Después de actualizar su contenido DITA, es posible que desee actualizar las traducciones de su proyecto. Todo lo que tienes que hacer en este momento es:

source: Generate a new XLIFF file.
es: Generar un nuevo archivo XLIFF

source: Send the new XLIFF file to your Language Service Provider and wait for a translated XLIFF.
es: Envíe el nuevo archivo XLIFF a su Proveedor de Servicios Lingüísticos y espere un XLIFF traducido.

source: Import the translated XLIFF and select the folder where to store the updated translated version of your map and topics.
es: Importe el archivo XLIFF traducido y seleccione una carpeta donde almacenar la versión traducida actualizada de su mapa y contenidos.

source: Fluenta automatically recovers In-Context Exact (ICE) matches from the translation that was stored in the previous cycle. This means that you don't need to pay again for the translation of content that didn't change.
es: Fluenta recupera automáticamente las coincidencias "In-Context Exact" (ICE) de la traducción que se almacenó en el ciclo anterior. Esto significa que no tendrá que volver a pagar por la traducción de contenidos que no hayan cambiado.

source: Thanks to the {ph0}Translation Memory{ph1} technology included in Fluenta, you can also recover translations of parts that were slightly changed.
es: Gracias a la tecnología de {ph0}Memoria de Traducción{ph1} incluida en Fluenta, también puede recuperar traducciones de partes ligeramente modificadas.

source: Advanced Configuration
es: Configuración Avanzada

source: Fluenta default settings can be changed in the {ph0}Preferences{ph1} dialog.
es: La configuración predeterminada de Fluenta puede modificarse en el cuadro de diálogo {ph0}Preferencias{ph1}.

source: To open the {ph0}Preferences{ph1} dialog on Windows or Linux, in main menu select {ph2} {ph3}Settings{ph4} {ph5}Preferences{ph6} {ph7}.
es: Para abrir el cuadro de diálogo {ph0}Preferencias{ph1} en Windows o Linux, en el menú principal seleccione {ph2} {ph3}Configuración{ph4} {ph5} Preferencias{ph6} {ph7}.

source: To open the {ph0}Preferences{ph1} dialog on macOS, select {ph2} {ph3}Apple{ph4} {ph5}Preferences{ph6} {ph7} in the menu.
es: Para abrir el cuadro de diálogo {ph0}Preferencias{ph1} en maOS, seleccione {ph2} {ph3}Apple{ph4} {ph5} Preferencias{ph6} {ph7} en el menú.

source: Command Line Interface
es: Interfaz de Línea de Comandos

source: Fluenta can be integrated into publishing and editing workflows using its Command Line Interface (CLI).
es: Fluenta puede integrarse en los flujos de trabajo de publicación y edición mediante su Interfaz de Línea de Comandos (CLI).

source: The methods exposed by Fluenta's CLI are:
es: Los métodos expuestos por la CLI de Fluenta son:

source: {ph0}Create a project{ph1};
es: {ph0}Crear un proyecto{ph1};

source: {ph0}Remove project{ph1};
es: {ph0}Eliminar Proyecto{ph1};

source: {ph0}Retrieve the list of projects{ph1};
es: {ph0}Obtener la lista de proyectos{ph1};

source: {ph0}Generate XLIFF files and optional word counts{ph1};
es: {ph0}Generar archivos XLIFF y estadísticas opcionales{ph1};

source: {ph0}Import an XLIFF file{ph1};
es: {ph0}Importar un archivo XLIFF{ph1};

source: {ph0}Create a memory{ph1};
es: {ph0}Crear una memoria{ph1};

source: {ph0}Retrieve the list of memories{ph1};
es: {ph0}Obtener la lista de memorias{ph1};

source: {ph0}Import a TMX file into a memory{ph1};
es: {ph0}Importar un archivo TMX en una memoria{ph1};

source: {ph0}Export a memory as TMX file{ph1};
es: {ph0}Exportar una memoria a un archivo TMX{ph1};

source: {ph0}Register a Subscription Key{ph1};
es: {ph0}Registrar una clave de suscripción{ph1};

source: {ph0}Retrieve version information{ph1}.
es: {ph0}Obtener información de versión{ph1}.

source: On macOS and Linux use {ph0}fluenta_cli.sh{ph1} for executing Fluenta without the graphical user interface.
es: En macOS y Linux utilice {ph0}fluenta_cli.sh{ph1} para ejecutar Fluenta sin su interfaz gráfica.

source: On macOS the default location for the script is {ph0}/Applications/Fluenta.app/Contents/Resources/fluenta_cli.sh{ph1}
es: En macOS la ubicación predeterminada del script es {ph0}/Applications/Fluenta.app/Contents/Resources/fluenta_cli.sh{ph1}

source: On Linux the default location for the shell script is {ph0}/opt/Maxprograms/Fluenta/fluenta_cli.sh{ph1}
es: En Linux la ubicación predeterminada del script es {ph0}/opt/Maxprograms/Fluenta/fluenta_cli.sh{ph1}

source: On Windows use {ph0}fluenta_cli.bat{ph1} (available in the default installation directory) to process command line parameters.
es: En Windows utilice {ph0}fluenta_cli.bat{ph1} (disponible en la carpeta predeterminada de instalación) para procesar los parámetros de la línea de comandos.

source: Configuration Files
es: Archivos de Configuración

source: Fluenta includes a configuration file for the 600+ elements defined defined in {ph0}Appendix B.6 of DITA 1.3 All-Inclusive Edition{ph1}.
es: Fluenta incluye un archivo de configuración para los más de 600 elementos definidos en el {ph0}Apéndice B.6 de DITA 1.3 All-Inclusive Edition{ph1}.

source: A configuration file for {ph0}Scalable Vector Graphics (SVG){ph1} is also shipped in fluenta installers.
es: Los instaladores de Fluenta también incluyen un archivo de configuración para {ph0}Scalable Vector Graphics{ph1} (SVG).

source: Additional configurations can be added by the user as required.
es: El usuario puede añadir configuraciones adicionales según sus necesidades.

source: Create Memory
es: Crear Memoria

source: Use the following parameters to create a memory from command line:
es: Utilice los siguientes parámetros para crear una memoria desde la línea de comandos:

source: Parameter
es: Parámetro

source: Value
es: Valor

source: Description
es: Descripción

source: Required
es: Requerido

source: JSON file
es: Archivo JSON

source: A JSON file containing the data required for creating the memory
es: Un archivo JSON que contiene los datos necesarios para crear la memoria

source: Yes
es: Si

source: Example:
es: Ejemplo:

source: Where the content of {ph0}addMemory.json{ph1} should be like:
es: Donde el contenido de {ph0}addMemory.json{ph1} debe ser similar a:

source: JSON Value Pairs
es: Pares de Valores JSON

source: Member
es: Clave

source: Data Type
es: Tipo de Dato

source: Description
es: Descripción

source: Required
es: Requerido

source: Number
es: Número

source: Memory identifier
es: Identificador de memoria

source: Yes
es: Si

source: String
es: Texto

source: Short text description for the memory. This is the description displayed in Fluenta's GUI.
es: Breve descripción de la memoria. Esta es la descripción que se muestra en la interfaz gráfica de Fluenta.

source: Yes
es: Si

source: String
es: Texto

source: A longer text description for the memory.
es: Una descripción de texto más larga para la memoria.

source: Yes
es: Si

source: String
es: Texto

source: Source language code.
es: Código del idioma origen.

source: Yes
es: Si

source: String Array
es: Arreglo de Texto

source: An array containing the target languages for the memory.
es: Un arreglo que contiene los códigos de idiomas destino para la memoria.

source: Yes
es: Si

source: Create Project
es: Crear Proyecto

source: Use the following parameters to create a project from command line:
es: Utilice los siguientes parámetros para crear un proyecto desde la línea de comandos:

source: Full path to a {ph0}JSON{ph1} file containing the data required for creating the project.
es: Ruta completa a un archivo {ph0}JSON{ph1} que contiene los datos necesarios para crear el proyecto.

source: Where the content of {ph0}addProject.json{ph1} should be like:
es: Donde el contenido de {ph0}addProject.json{ph1} debe ser similar a:

source: Project identifier
es: Identificador de proyecto

source: Short text description for the project. This is the description displayed in Fluenta's GUI
es: Breve descripción del proyecto. Esta es la descripción que se muestra en la interfaz gráfica de Fluenta.

source: A longer text description for the project
es: Una descripción de texto más larga para el proyecto.

source: Path to the project DITA map
es: Ruta al mapa DITA del proyecto

source: String
es: Texto

source: Language code for the original DITA content
es: Código de idioma del contenido original del proyecto

source: String Array
es: Arreglo de Texto

source: An array containing the target languages for the project
es: Un arreglo que contiene los códigos de idiomas destino para el proyecto.

source: Yes
es: Si

source: Number Array
es: Arreglo Numérico

source: An array containing the ids of existing memories to be associated with the project
es: Un arreglo que contiene los identificadores de las memorias existentes que se asociarán al proyecto

source: Licenses
es: Licencias

source: Fluenta uses components from these open source projects:
es: Fluenta utiliza componentes de estos proyectos de código abierto:

source: Formerly available from {ph0}http://wutka.com/dtdparser.html{ph1}
es: Antes disponible en {ph0}http://wutka.com/dtdparser.html{ph1}

source: Published under two licenses: {ph0}Apache Style License{ph1} and {ph2}LGPL 2.1{ph3}
es: Publicado bajo dos licencias: {ph0}Licencia de Estilo Apache{ph1} y {ph2}LGPL 2.1{ph3}

source: Available from {ph0}https://github.com/stleary/JSON-java{ph1}
es: Disponible en {ph0}https://github.com/stleary/JSON-java{ph1}

source: Published under a {ph0}custom license{ph1}
es: Publicado bajo una {ph0}licencia personalizada{ph1}

source: Available from {ph0}https://jsoup.org{ph1}
es: Disponible en {ph0}https://jsoup.org{ph1}

source: Published under {ph0}MIT License{ph1}
es: Publicado bajo la {ph0}Licencia MIT{ph1}

source: Available from {ph0}https://h2database.com/{ph1}
es: Disponible en {ph0}https://h2database.com/{ph1}

source: Published under two licenses: {ph0}Mozilla Public License 2.0{ph1} and {ph2}Eclipse Public License 1.0{ph3}
es: Publicado bajo dos licencias: {ph0}Licencia Pública Mozilla 2.0{ph1} y {ph2}Licencia Pública Eclipse 1.0{ph3}

source: Available from {ph0}https://mapdb.org{ph1}
es: Disponible en {ph0}https://mapdb.org{ph1}

source: Published under {ph0}Apache License{ph1}
es: Publicado bajo la {ph0}Licencia Apache{ph1}

source: Available from {ph0}https://www.maxprograms.com/products/openxliff.html{ph1}
es: Disponible en {ph0}https://www.maxprograms.com/products/openxliff.html{ph1}

source: Published under {ph0}Eclipse Public License 1.0{ph1}
es: Publicado bajo la {ph0}Licencia Pública Eclipse 1.0{ph1}

source: Available from {ph0}https://www.maxprograms.com/products/swordfish.html{ph1}
es: Disponible en {ph0}https://www.maxprograms.com/products/swordfish.html{ph1}

source: Published under {ph0}Eclipse Public License 1.0{ph1}
es: Publicado bajo la {ph0}Licencia Pública Eclipse 1.0{ph1}

source: Available from {ph0}https://www.eclipse.org/swt/{ph1}
es: Disponible en {ph0}https://www.eclipse.org/swt/{ph1}

source: Published under {ph0}Eclipse Public License 2.0{ph1}
es: Publicado bajo la {ph0}Licencia Pública Eclipse 2.0{ph1}

source: Published under {ph0}Eclipse Public License 1.0{ph1}
es: Publicado bajo la {ph0}Licencia Pública Eclipse 1.0{ph1}

source: Export TMX File
es: Exportar Archivo TMX

source: Use the following parameters to export a memory as a {ph0}TMX{ph1} file from command line:
es: Utilice los siguientes parámetros para exportar una memoria como archivo {ph0}TMX{ph1} desde la línea de comandos:

source: memId
es: idMemoria

source: The id of the memory to be exported
es: El identificador de la memoria a exportar

source: tmxFile
es: archivoTmx

source: Path to the TMX file to be generated
es: Ruta al archivo TMX a generar

source: Yes
es: Si

source: Example:
es: Ejemplo:

source: Generate XLIFF Files
es: Generar Archivos XLIFF

source: Use the following parameters to generate XLIFF files for a project from command line:
es: Utilice los siguientes parámetros para generar archivos XLIFF desde la línea de comandos:

source: Full path to a {ph0}JSON{ph1} file containing the data required for generating XLIFF files.
es: Ruta completa a un archivo {ph0}JSON{ph1} que contiene los datos necesarios para generar los archivos XLIFF.

source: Selects whether progress information is logged or not in stdout.
es: Selecciona si la información de progreso se muestra o no en la consola.

source: Example:
es: Ejemplo:

source: Where the content of {ph0}genXLIFF.json{ph1} should be like:
es: Donde el contenido de {ph0}genXLIFF.json{ph1} debe ser similar a:

source: JSON Value Pairs
es: Pares de Valores JSON

source: Member
es: Clave

source: Data Type
es: Tipo de Dato

source: Description
es: Descripción

source: Required
es: Requerido

source: Number
es: Número

source: Project identifier
es: Identificador de proyecto

source: Yes
es: Si

source: String
es: Texto

source: Path to the folder where XLIFF files and optional word counts should be stored
es: Ruta a la carpeta donde deben guardarse los archivos XLIFF y estadísticas opcionales

source: Yes
es: Si

source: String Array
es: Arreglo de Texto

source: An array containing the target languages for the XLIFF files
es: Un arreglo que contiene los códigos de idiomas destino para los archivos XLIFF

source: Yes
es: Si

source: String
es: Texto

source: Path to a .ditaval file for filtering content to be extracted
es: Ruta a un archivo .ditaval para filtrar el contenido a extraer

source: Boolean
es: Booleano

source: Selects wheteher existing ICE matches should be reused. Default {ph0}false{ph1}
es: Selecciona si las coincidencias ICE existentes deben reutilizarse. Valor predeterminado: {ph0}false{ph1}.

source: Boolean
es: Booleano

source: Selects wether topics that have not changed since the last translation cycle should be included in the generated XLIFF files. Default value: {ph0}false{ph1}
es: Selecciona si los archivos que no han cambiado desde el último ciclo de traducción deben incluirse en los documentos XLIFF generados. Valor predeterminado: {ph0}false{ph1}

source: Boolean
es: Booleano

source: Selects whether translation memories should be used. Default value: {ph0}false{ph1}
es: Selecciona si debe usarse memorias de traducción. Valor predeterminado: {ph0}false{ph1}

source: Boolean
es: Booleano

source: Selects whether word counts should be generated. Default value: {ph0}false{ph1}
es: Selecciona si debe generarse estadísticas. Valor predeterminado: {ph0}false{ph1}

source: Boolean
es: Booleano

source: Selects whether XLIFF 2.0 will be generated instead of XLIFF 1.2. Default value: {ph0}false{ph1}
es: Selecciona si se generará XLIFF 2.0 en lugar de XLIFF 1.2. Valor predeterminado: {ph0}false{ph1}

source: Boolean
es: Booleano

source: Selects wether paragraph segmentation should be used instead of sentence segmentation. Default value: {ph0}false{ph1}
es: Selecciona si se debe utilizar segmentación por párrafos en lugar de segmentación por oraciones. Valor predeterminado: {ph0}false{ph1}

source: Boolean
es: Booleano

source: Selects wether tracked changes from Oxygen XML Editor should be ignored. Default value: {ph0}false{ph1}
es: Selecciona si se deben ignorar las revisiones de Oxygen XML Editor. Valor predeterminado: {ph0}false{ph1}

source: Boolean
es: Booleano

source: Selects whether skeletons should be embedded in the generated XLIFF files, allowing conversion back to DITA in any computer using {ph0}OpenXLIFF Filters{ph1} or {ph2}XLIFF Manager{ph3}. Default value: {ph4}false{ph5}
es: Selecciona si los esqueletos deben incrustarse en los archivos XLIFF generados, permitiendo la conversión de nuevo a DITA en cualquier ordenador que utilice {ph0}OpenXLIFF Filters{ph1} o {ph2}XLIFF Manager{ph3}. Valor predeterminado: {ph4}false{ph5}

source: Import TMX File
es: Importar archivo TMX

source: Use the following parameters to import a {ph0}TMX{ph1} file into a memory from command line:
es: Utilice los siguientes parámetros para importar un archivo {ph0}TMX{ph1} a una memoria desde la línea de comandos:

source: The id of the memory.
es: Identificador de la memoria

source: Path to the TMX file to be imported
es: Ruta al archivo TMX a importar

source: Selects whether progress information is logged or not in stdout
es: Selecciona si la información de progreso se muestra o no en la consola

source: Example:
es: Ejemplo:

source: Import XLIFF File
es: Importar Archivo XLIFF

source: Use the following parameters to import a translated XLIFF file into a project from command line:
es: Utilice los siguientes parámetros para importar desde la línea de comandos archivos XLIFF traducidos en un proyecto :

source: Full path to a {ph0}JSON{ph1} file containing the data required for importing the XLIFF file
es: Ruta completa a un archivo {ph0}JSON{ph1} que contiene los datos necesarios para importar el archivo XLIFF

source: Where the content of {ph0}impXLIFF.json{ph1} should be like:
es: Donde el contenido de {ph0}impXLIFF.json{ph1} debe ser similar a:

source: Path to the XLIFF file to be imported
es: Ruta al archivo XLIFF a importar

source: Boolean
es: Booleano

source: Path to the folder where the translated DITA files should be stored
es: Ruta a la carpeta donde deben guardarse los archivos DITA traducidos

source: Boolean
es: Booleano

source: Selects whether the memory associated with the project should be updated with the translations in the XLIFF file
es: Selecciona si la memoria asociada al proyecto debe actualizarse con las traducciones del archivo XLIFF

source: Yes
es: Si

source: Selects whether segments that are translated but not approved should be treated as approved. Default value: {ph0}false{ph1}
es: Selecciona si los segmentos traducidos pero no aprobados deben tratarse como aprobados. Valor predeterminado: {ph0}false{ph1}

source: Selects whether inline tag errors should be ignored. If set to {ph0}false{ph1} and errors are found, a detailed report in HTML format is generated and stored in the folder that contains the XLIFF file. Default value: {ph2}false{ph3}
es: Selecciona si los errores de etiquetas deben ignorarse. Si se establece en {ph0}false{ph1} y se encuentran errores, se genera un informe detallado en formato HTML que se almacena en la carpeta que contiene el archivo XLIFF. Valor predeterminado: {ph2}false{ph3}

source: Subscription Management
es: Manejo de Subscripciones

source: Use the following parameters to register a Subscription Key from command line:
es: Utilice los siguientes parámetros para registrar una clave de suscripción desde la línea de comandos:

source: key
es: clave

source: The Subscription Key to be registered
es: La clave de suscripción a registrar

source: Registering a Subscription Key requires an Internet connection.
es: El registro de una clave de suscripción requiere una conexión a Internet.

source: General Options
es: Opciones Generales

source: The following picture shows the {ph0}General{ph1} tab of the {ph2}Preferences{ph3} dialog:
es: La siguiente imagen muestra la pestaña {ph0}General{ph1} del cuadro de diálogo {ph2}Preferencias{ph3}:

source: Project related options
es: Opciones relacionadas con proyectos

source: Use the {ph0}Application Language{ph1} drop-down to select the language to use in the Graphical User Interface ((GUI).
es: Utilice la lista desplegable {ph0}Idioma de la Aplicación{ph1} para seleccionar el idioma que se utilizará en la interfaz gráfica de usuario (GUI).

source: If you want to change storage locations for your projects or memories, enter the desired paths on the {ph0}Projects Folder{ph1} and {ph2}Memories Folder{ph3} text boxes or click the associated {ph4}Browse...{ph5} buttons to select folders from the file system.
es: Si desea cambiar las ubicaciones de almacenamiento de sus proyectos o memorias, introduzca las rutas deseadas en los cuadros de texto {ph0}Carpeta de Proyectos{ph1} y {ph2}Carpeta de Memorias{ph3} o haga clic en los botones {ph4}Examinar...{ph5} asociados para seleccionar carpetas del sistema de archivos.

source: Avoid using folders that could be modified by other programs while you work.
es: Evite usar carpetas que puedan ser modificadas por otros programas mientras trabaja.

source: To change the default {ph0}SRX{ph1} (Segmentation Rules eXchange) file that Fluenta uses for segmenting XLIFF files:
es: Para cambiar el archivo {ph0}SRX{ph1} (Segmentation Rules eXchange) predeterminado que Fluenta utiliza para segmentar archivos XLIFF:

source: Type the name of the SRX file in the {ph0}Default SRX File{ph1} text box or use the {ph2}Browse...{ph3} button to select an SRX file from the file system.
es: Escriba el nombre del archivo SRX en el cuadro de texto {ph0}Archivo SRX Predeterminado{ph1} o utilice el botón {ph2}Examinar...{ph3} para seleccionar un archivo SRX del sistema de archivos.

source: To add new target languages to the default set:
es: Para añadir nuevos idiomas al conjunto predeterminado:

source: click the {ph0}Add Target Language{ph1} button and the following dialog will appear: {ph2}
es: Haga clic en el botón {ph0}Añadir Idioma Destino{ph1} y aparecerá el siguiente cuadro de diálogo: {ph2}

source: {ph0}Add Language{ph1} dialog
es: Cuadro de diálogo {ph0}Añadir Idioma{ph1}

source: Select a language from the {ph0}Language{ph1} drop-down list.
es: Seleccione un idioma de la lista desplegable {ph0}Idioma{ph1}.

source: Click the {ph0}Add Language{ph1} button.
es: Haga clic en el botón {ph0}Añadir Idioma{ph1}.
