Repository: oxygenxml/Fluenta
Catalog: docs/XLIFF/fluenta_*.ditamap.xlf
Languages: es

source: To remove unnecessary languages from the default set:
es: Para eliminar idiomas innecesarios del conjunto predeterminado:

source: Select the check boxes next to each language you want to remove.
es: Seleccione las casillas de verificación situadas junto a cada idioma que desee eliminar.

source: Click the {ph0}Remove Selected Languages{ph1} button.
es: Haga clic en el botón {ph0}Eliminar Idiomas Seleccionados{ph1}.

source: Click the {ph0}Save Preferences{ph1} button after making any change to the default settings.
es: Haga clic en el botón {ph0}Guardar Preferencias{ph1} después de hacer cambios en la configuración predeterminada.

source: Remove Project
es: Eliminar Proyecto

source: Use the following parameters to remove a project from command line:
es: Utilice los siguientes parámetros para eliminar un proyecto desde la línea de comandos:

source: Project identifier
es: Identificador de proyecto

source: Retrieve Memory List
es: Obtener Lista de Memorias

source: Use the following parameter to retrieve the list of memories from command line:
es: Utilice los siguientes parámetros para obtener la lista de memorias desde la línea de comandos:

source: Yes
es: Si

source: Example:
es: Ejemplo:

source: Output example:
es: Ejemplo de salida:

source: Retrieve Project List
es: Obtener Lista de Proyectos

source: Use the following parameter to retrieve the list of projects from command line:
es: Utilice los siguientes parámetros para obtener la lista de proyectos desde la línea de comandos:

source: Subscriptions
es: Suscripciones

source: Fluenta is available in two modes:
es: Fluenta está disponible en dos modos:

source: Source Code
es: Código Fuente

source: Yearly Subscriptions for installers and support
es: Suscripciones Anuales para instaladores y soporte técnico

source: Source Code
es: Código Fuente

source: Source code of Fluenta is free. Anyone can download the source code from {ph0}Github.com{ph1}, compile, modify and use it at no cost in compliance with the accompanying license terms.
es: El código fuente de Fluenta es libre. Cualquiera puede descargar el código fuente de {ph0}Github.com{ph1}, compilarlo, modificarlo y utilizarlo sin costo alguno respetando los términos de la licencia adjunta.

source: Subscriptions
es: Suscripciones

source: The version of Fluenta included in the official installers from {ph0}Maxprograms Download Page{ph1} can be used at no cost for 30 days requesting a free Evaluation Key.
es: La versión de Fluenta incluida en los instaladores oficiales de la {ph0}página de descargas de Maxprograms{ph1} puede utilizarse sin costo durante 30 días solicitando un código de evaluación gratuito.

source: Subscription Keys are available at {ph0}Maxprograms Online Store{ph1}. Subscription Keys cannot be shared or transferred to different machines.
es: Las Claves de Suscripción están disponibles en la {ph0}tienda en línea de Maxprograms{ph1}. Las Claves de Suscripción no se pueden compartir ni transferir a diferentes ordenadores.

source: Subscription version includes unlimited direct email support at {ph0}tech@maxprograms.com{ph1}
es: La versión de suscripción incluye asistencia directa ilimitada por correo electrónico en {ph0}tech@maxprograms.com{ph1}

source: Differences Summary
es: Resumen de Diferencias

source: Source Code
es: Código Fuente

source: Subscription Based
es: Por Suscripción

source: Ready To Use Installers
es: Instaladores listos para usar

source: Yes
es: Si

source: Notarized macOS launcher
es: Ejecutable de macOS notariado

source: Signed launcher and installer for Windows
es: Ejecutable e instalador para Windows firmado digitalmente

source: Restricted Features
es: Características Restringidas

source: None
es: Ninguna

source: None
es: Ninguna

source: Technical Support
es: Soporte Técnico

source: Peer support at {ph0}Groups.io{ph1}
es: Apoyo de otros usuarios en {ph0}Groups.io{ph1}

source: Direct email at {ph0}tech@maxprograms.com{ph1}
es: Correo electrónico directo a {ph0}tech@maxprograms.com{ph1}

source: Peer support at {ph0}Groups.io{ph1}
es: Apoyo de otros usuarios en {ph0}Groups.io{ph1}

source: Translating DITA Projects
es: Traducir Proyectos DITA

source: Translating DITA projects is a process that comprises these steps:
es: Traducir proyectos DITA es un proceso que comprende estos pasos:

source: Create a project
es: Crear un proyecto

source: Generate XLIFF files
es: Generar archivos XLIFF

source: Translate XLIFF files
es: Traducir archivos XLIFF

source: Import translated XLIFF files
es: Importar archivos XLIFF traducidos

source: Translation Memories
es: Memorias de Traducción

source: Translation Memory (TM) is a language technology that enables the translation of segments (paragraphs, sentences or phrases) of documents by searching for similar segments in a database and suggesting matches that are found in the databases as possible translations.
es: La Memoria de Traducción (MT) es una tecnología lingüística que permite traducir segmentos (párrafos, frases u oraciones) de documentos mediante la búsqueda de segmentos similares en una base de datos y la sugerencia de coincidencias encontradas en las bases de datos como posibles traducciones.

source: When you create a project, a new translation memory is automatically created and associated with your project. When you import a translated XLIFF file, the memory associated with the project is populated with the translations included in the XLIFF file.
es: Al crear un proyecto, se crea automáticamente una nueva memoria de traducción asociada al proyecto. Al importar un archivo XLIFF traducido, la memoria asociada al proyecto se rellena con las traducciones incluidas en el archivo XLIFF.

source: When you generate a new XLIFF file after adding new content to your project, Fluenta can reuse the data stored in the associated memories to translate the newly added content, reducing translation costs.
es: Cuando se genera un nuevo archivo XLIFF tras añadir nuevos contenidos al proyecto, Fluenta puede reutilizar los datos almacenados en las memorias asociadas para traducir los contenidos recién añadidos, reduciendo así los costes de traducción.

source: Retrieve Version Information
es: Obtener Información de Versión

source: Use the following parameter to retrieve Fluenta version and build information from command line:
es: Utilice el siguiente parámetro para recuperar la versión de Fluenta y la información de compilación desde la línea de comandos:

source: XML Catalog
es: Catálogo XML

source: The application includes a default XML catalog with DTDs and XML Schemas for the most relevant formats and supported document types. Additional DTDs and XML Schemas can be added by the user as needed.
es: La aplicación incluye un catálogo XML predeterminado con DTD y esquemas XML para los formatos más relevantes y los tipos de documentos compatibles. El usuario puede añadir DTD y esquemas XML adicionales según sus necesidades.

source: Select the {ph0}XML Options{ph1} tab in the {ph2}Preferences{ph3} dialog to add or remove entries from the catalog.
es: Seleccione la pestaña {ph0}Opciones XML{ph1} en el cuadro de diálogo {ph2}Preferencias{ph3} para añadir o eliminar entradas del catálogo.

source: Add Catalog Entry
es: Añadir Entrada de Catálogo

source: Click the {ph0}Add Catalog Entry{ph1} button and a file selection dialog will appear. Locate the catalog in the file system and select it.
es: Haga clic en el botón {ph0}Añadir Entrada de Catálogo{ph1} y aparecerá un cuadro de diálogo de selección de archivos. Localice el catálogo en el sistema de archivos y selecciónelo.

source: Remove Catalog Entry
es: Eliminar Entrada de Catálogo

source: Select the catalog entry to remove in the catalogs table. Click the {ph0}Remove Catalog Entry{ph1} button and the application's catalog will be updated to reflect the change.
es: Seleccione la entrada de catálogo que desea eliminar en la tabla de catálogos. Pulse el botón {ph0}Eliminar Entrada de Catálogo{ph1} y el catálogo de la aplicación se actualizará para reflejar el cambio.

source: XML Options
es: Opciones de XML

source: Fluenta needs to know two things for working with XML files:
es: Fluenta necesita saber dos cosas para trabajar con archivos XML:

source: How to locate the grammar rules and entities declared in an XML file, if any.
es: Cómo localizar las reglas gramaticales y las entidades declaradas en un archivo XML, si las hay.

source: What elements and attributes contain translatable text.
es: Qué elementos y atributos contienen texto traducible.

source: XML catalogs that follow the specification published at {ph0}https://www.oasis-open.org/committees/entity/spec-2001-08-06.html{ph1} by OASIS are used to resolve the location of XML DTDs and Schemas.
es: Se utilizan catálogos XML según la especificación publicada por OASIS en {ph0}https://www.oasis-open.org/committees/entity/spec-2001-08-06.html{ph1} para resolver la ubicación de archivos DTD y XML Schema.

source: Special XML files are used to configure the elements and attributes that contain translatable text. These files are used by the internal XML filter to extract text for processing. The configuration files are created and maintained using the application's graphical user interface.
es: Se utilizan archivos XML especiales para configurar los elementos y atributos que contienen texto traducible. Estos archivos son utilizados por el filtro XML interno para extraer texto para su procesamiento. Los archivos de configuración se crean y mantienen mediante la interfaz gráfica de usuario de la aplicación.

source: The following picture shows the {ph0}XML Options{ph1} tab of the {ph2}Preferences{ph3} dialog:
es: La siguiente imagen muestra la pestaña {ph0}Opciones XML{ph1} del cuadro de diálogo {ph2}Preferencias{ph3}:

source: XML Options
es: Opciones de XML

source: Translating DITA Projects
es: Traducir Proyectos DITA

source: JavaScript Object Notation (JSON) is an open standard for the serialization of structured data in text format . It is derived from the object literals of JavaScript, as defined in the ECMAScript Programming Language Standard, Third Edition. JSON specification is available at {ph0}https://tools.ietf.org/html/rfc7159{ph1}.
es: JavaScript Object Notation (JSON) es un estándar abierto para la serialización de datos estructurados en formato de texto . Se deriva de los literales de objeto de JavaScript, tal y como se definen en el Estándar del Lenguaje de Programación ECMAScript, Tercera Edición. La especificación JSON está disponible en {ph0}https://tools.ietf.org/html/rfc7159{ph1}.

source: Language Service Provider (LSP)
es: Proveedor de Servicios Lingüísticos (PSL)

source: A company or individual specialized in providing translation and localization services.
es: Una empresa o individuo especializado en proporcionar servicios de traducción y localización.

source: OASIS ({ph0}Organization for the Advancement of Structured Information Standards{ph1}) is a not-for-profit consortium that drives the development, convergence and adoption of open standards for the global information society.
es: OASIS ({ph0}Organization for the Advancement of Structured Information Standards{ph1}) es un consorcio sin fines de lucro que impulsa el desarrollo, la convergencia y la adopción de normas abiertas para la sociedad global de la información.

source: Segmentation Rules eXchange (SRX) is an XML-based open standard, originally published by LISA (Localization Industry Standards Association), for describing how translation and other language-processing tools segment text for processing.
es: Segmentation Rules eXchange (SRX) es un estándar abierto basado en XML, publicado por LISA (Localization Industry Standards Association), para describir cómo las herramientas de traducción y de procesamiento de idiomas segmentan el texto para su procesamiento.

source: Translation Memory eXchange (TMX) is an open standard originally published by LISA (Localization Industry Standards Association). The purpose of TMX is to allow easier exchange of translation memory data between tools and/or translation vendors with little or no loss of critical data during the process.
es: Translation Memory eXchange (TMX) es un estándar abierto publicado originalmente por LISA (Localization Industry Standards Association). El propósito de TMX es permitir un intercambio más fácil de datos de memorias de traducción entre herramientas y/o proveedores de traducción con poca o ninguna pérdida de datos críticos durante el proceso.

source: XLIFF (XML Localization Interchange File Format) is an open standard developed by {ph0}OASIS{ph1} (Organization for the Advancement of Structured Information Standards). The purpose of this vocabulary is to store localizable data and carry it from one step of the localization process to the other, while allowing interoperability between tools.
es: XLIFF (XML Localization Interchange File Format) es un estándar abierto desarrollado por {ph0}OASIS{ph1} (Organization for the Advancement of Structured Information Standards). El propósito de este vocabulario es almacenar datos localizables y llevarlos de un paso del proceso de localización a otro, al tiempo que permite la interoperabilidad entre herramientas.

source: Translation Memory
es: Memoria de Traducción

source: Generate XLIFF
es: Generar XLIFF

source: Send XLIFF{ph0}{ph1}Out for{ph2}{ph3}Translation
es: Enviar {ph0}{ph1}XLIFF para{ph2}{ph3} Traducción

source: Import{ph0}{ph1}Translated XLIFF
es: Importar{ph0}{ph1}XLIFF Traducido

source: Update{ph0}{ph1}DITA Content
es: Actualizar{ph0}{ph1}Contenido DITA

source: Publish{ph0}{ph1}Translated DITA
es: Publicar{ph0}{ph1}DITA Traducido

source: Add Configuration File
es: Añadir Archivo de Configuración

source: In {ph0}XML Options{ph1} tab of the {ph2}Preferences{ph3} dialog, click the {ph4}Add Configuration File{ph5} button.
es: En la pestaña {ph0}Opciones XML{ph1} del cuadro de diálogo {ph2}Preferencias{ph3}, haga cic en el botón {ph4}Añadir Archivo de Configuración{ph5}.

source: The following dialog appears:
es: El siguiente cuadro de diálogo aparece:

source: {ph0}Add Configuration File{ph1} dialog
es: Cuadro de diálogo {ph0}Añadir Archivo de Configuración{ph1}

source: Type the name of the root element of your XML files in the {ph0}Root Element{ph1} text box. The name of the root element is used to name the configuration file.
es: Escriba el nombre del elemento raíz de sus archivos XML en el cuadro de texto {ph0}Elemento Raíz{ph1}. El nombre del elemento raíz se utiliza para nombrar el archivo de configuración.

source: Click the {ph0}Add Configuration File{ph1} button.
es: Haga clic en el botón {ph0}Añadir Archivo de Configuración{ph1}.

source: The following dialog appears:
es: El siguiente cuadro de diálogo aparece:

source: {ph0}Grammar Configuration{ph1} dialog
es: Cuadro de diálogo {ph0}Configuración de Grámatica{ph1}

source: Click the {ph0}Add Element{ph1} button to add the configuration of an element.
es: Haga clic en el botón {ph0}Añadir Elemento{ph1} para añadir la configuración de un elemento.

source: The following dialog appears:
es: El siguiente cuadro de diálogo aparece:

source: {ph0}Element Configuration{ph1} dialog
es: Cuadro de diálogo {ph0}Configuración de Elemento{ph1}

source: Type the name of the element being added in the {ph0}Element Name{ph1} text box.
es: Escriba el nombre del elemento a añadir en el cuadro de texto {ph0}Nombre del Elemento{ph1}.

source: Select the type of element in the {ph0}Element Type{ph1} drop-down list. Available types are:
es: Seleccione el tipo de elemento en la lista desplegable {ph0}Tipo de Elemento{ph1}. Los tipos disponibles son:

source: {ph0}segment{ph1}: the selected element starts a new section of translatable text.
es: {ph0}segment{ph1}: el elemento seleccionado inicia una nueva sección de texto traducible.

source: {ph0}inline{ph1}: the selected element represents a change in formatting options and does not start a new section of translatable text.
es: {ph0}inline{ph1}: el elemento seleccionado representa un cambio en las opciones de formato y no inicia una nueva sección de texto traducible.

source: {ph0}ignore{ph1}: the selected element and its children should be ignored.
es: {ph0}ignore{ph1}: el elemento seleccionado y sus descendientes deben ignorarse.

source: If the element type is "inline", select the kind of formatting represented by the element in the {ph0}Inline Type{ph1} drop-down list.
es: Si el tipo de elemento es "inline", seleccione el tipo de formato que ele elemento representa en la lista desplegable {ph0}Tipo de Formato{ph1}.

source: If the element has translatable attributes, enter their names separated by a ";" in the {ph0}Translatable Attributes{ph1} text box.
es: Si el elemento tiene atributos traducibles, introduzca sus nombres separados por un ";" en el cuadro de texto {ph0}Atributos Traducibles{ph1}.

source: If white space needs to be preserved when extracting text, select "Yes" in the {ph0}Keep White Space{ph1} drop-down list.
es: Si es necesario conservar los espacios en blanco al extraer el texto, seleccione "Yes" en la lista desplegable {ph0}Preservar Espacios{ph1}.

source: Click the {ph0}Save Configuration{ph1} button.
es: Haga clic en el botón {ph0}Guardar Configuración{ph1}.

source: Repeat the previous steps until all required elements have been configured.
es: Repita los pasos anteriores hasta haber configurado todos los elementos necesarios.

source: A new configuration file for the XML filter is created.
es: Un nuevo archivo de configuración para el filtro de XML es creado.

source: Follow these steps to create a new translation memory.
es: Siga estos pasos para crear una nueva memoria de traducción.

source: In main menu, select {ph0} {ph1}Memories{ph2} {ph3}Create Memory{ph4} {ph5} or click the {ph6}{ph7}Create Memory{ph8}Create Memory{ph9} button in {ph10}Memories{ph11} view toolbar.
es: En el menú principal, seleccione {ph0} {ph1}Memorias{ph2} {ph3}Crear Memoria{ph4} {ph5} o haga clic en el botón {ph6}{ph7}Crear Memoria{ph8}Crear Memoria{ph9} de la barra de herramientas de la vista {ph10}Memorias{ph11}.

source: The following dialog appears:
es: El siguiente cuadro de diálogo aparece:

source: {ph0}Create Memory{ph1} dialog
es: Cuadro de diálogo {ph0}Crear Memoria{ph1}

source: Type a name for the new memory in the {ph0}Memory Name{ph1} text box.
es: Ingrese un nombre para la nueva memoria en el cuadro de texto {ph0}Nombre de la Memoria{ph1}.

source: Select the source language for the new memory in the {ph0}Source Language{ph1} drop-down list.
es: Seleccione el idioma origen para la nueva memoria de la lista desplegable {ph0}Idioma Origen{ph1}.

source: Optionally, enter a description in the {ph0}Memory Description{ph1} text box.
es: Si lo desea, introduzca una descripción en el cuadro de texto {ph0}Descripción de la memoria{ph1}.

source: Click the {ph0}Create Memory{ph1} button.
es: Haga clic en el botón {ph0}Crear Memoria{ph1}.

source: A new memory is created and the list of memories in the {ph0}Memories{ph1} view is updated to reflect the changes.
es: Se crea una nueva memoria y la lista de memorias de la vista {ph0}Memorias{ph1} se actualiza para reflejar los cambios.

source: Follow these steps to create a translation project from your DITA map.
es: Siga estos pasos para crear un proyecto de traducción a partir de su mapa DITA.

source: In main menu, select {ph0} {ph1}Projects{ph2} {ph3}Create Project{ph4} {ph5} or click the {ph6}{ph7}Create Project{ph8}Create Project{ph9} button in {ph10}Projects{ph11} view toolbar.
es: En el menú principal, seleccione {ph0} {ph1}Proyectos{ph2} {ph3}Crear Proyecto{ph4} {ph5} o haga clic en el botón {ph6}{ph7}Crear Proyecto{ph8}Crear Proyecto{ph9} de la barra de herramientas de la vista {ph10}Proyectos{ph11}.

source: {ph0}Create Project{ph1} dialog
es: Cuadro de diálogo {ph0}Crear Proyecto{ph1}

source: Type the name of the DITA map in the {ph0}DITA Map{ph1} text box or use the {ph2}Browse...{ph3} button to select a DITA map from the file system.
es: Escriba el nombre del mapa DITA en el cuadro de texto {ph0}Mapa DITA{ph1} o utilice el botón {ph2}Examinar...{ph3} para seleccionar un mapa DITA del sistema de archivos.

source: Type a project name in the {ph0}Project Name{ph1} text box.
es: Ingrese un nombre para el proyecto en el cuadro de texto {ph0}Nombre del Proyecto{ph1}.

source: Optionally, enter a description for the project in the {ph0}Project Description{ph1} text box.
es: Si lo desea, introduzca una descripción en el cuadro de texto {ph0}Descripción del Proyecto{ph1}.

source: Add additional target languages to the default set if required.
es: Añada nuevos idiomas destino al conjunto predeterminado de ser necesario.

source: Click {ph0}Add Target Language{ph1} button.
es: Haga clic en el botón {ph0}Añadir Idioma Destino{ph1}.

source: The following dialog appears:
es: El siguiente cuadro de diálogo aparece:

source: {ph0}Add Language{ph1} dialog
es: Cuadro de diálogo {ph0}Añadir Idioma{ph1}

source: Select a language from the {ph0}Language{ph1} drop-down list.
es: Seleccione un idioma de la lista desplegable {ph0}Idioma{ph1}.

source: Click the {ph0}Add Language{ph1} button.
es: Haga clic en el botón {ph0}Añadir Idioma{ph1}.

source: Selected language is added to the project and the dialog is closed.
es: El idioma seleccionado se añade al proyecto y se cierra el cuadro de diálogo.

source: Remove unnecessary languages from the default language set if required.
es: Si es necesario, elimine del conjunto de idiomas predeterminado aquellos que no vaya a utilizar.

source: Select the check boxes next to each language you want to remove.
es: Seleccione las casillas de verificación situadas junto a cada idioma que desee eliminar.

source: Click the {ph0}Remove Selected Languages{ph1} button.
es: Haga clic en el botón {ph0}Eliminar Idiomas Seleccionados{ph1}.

source: Associate additional memories with the new project if required.
es: Si es necesario, asocie memorias adicionales al nuevo proyecto.

source: Click on the {ph0}Memories{ph1} tab.
es: Haga clic en la pestaña {ph0}Memorias{ph1}.

source: The {ph0}Memories{ph1} tab opens and the {ph2}Create Project{ph3} dialog changes to: {ph4}
es: La pestaña {ph0}Memorias{ph1} se abre y el cuadro de diálogo {ph2}Crear Proyecto{ph3} cambia a: {ph4}

source: {ph0}Create Project{ph1} dialog, {ph2}Memories{ph3} view
es: Cuadro de diálogo {ph0}Crear Proyecto{ph1}, vista de {ph2}Memorias{ph3}

source: Click the {ph0}Associate Other Memories{ph1} button.
es: Haga clic en el botón {ph0}Asociar Otras Memorias{ph1}.

source: The following dialog appears:
es: El siguiente cuadro de diálogo aparece:

source: {ph0}Additional Memories{ph1} dialog
es: Cuadro de diálogo {ph0}Memorias Adicionales{ph1}

source: Select the check boxes next to the memories that you want to associate with the new project.
es: Seleccione las casillas de verificación situadas junto a las memorias que desea asociar al nuevo proyecto.

source: Click the {ph0}Add Selected Memories{ph1} button.
es: Haga clic en el botón {ph0}Añadir Memorias Seleccionadas{ph1}.

source: Selected memories are associated with the new project and the dialog closes.
es: Las memorias seleccionadas se asocian al nuevo proyecto y el cuadro de diálogo se cierra.

source: Click the {ph0}Create Project{ph1} button.
es: Haga clic en el botón {ph0}Crear Proyecto{ph1}.

source: A new project is created and the list of projects in the {ph0}Projects{ph1} view is updated to reflect the changes.
es: Se crea un nuevo proyecto y la lista de proyectos de la vista {ph0}Proyectos{ph1} se actualiza para reflejar los cambios.

source: Edit Configuration File
es: Modificar Archivo de Configuración
