Repository: oxygenxml/Fluenta
Catalog: docs/XLIFF/fluenta_*.ditamap.xlf
Languages: es

source: Enter the evaluation subscription in the {ph0}Subscription Key{ph1} text box of the {ph2}Subscription Management{ph3} dialog.
es: Escriba su clave de evaluación en el cuadro de texto {ph0}Clave de Suscripción{ph1} del cuadro de diálogo {ph2}Manejo de Suscripciones{ph3}.

source: Click the {ph0}Register Subscription{ph1} button.
es: Haga clic en el botón {ph0}Registrar Suscripción{ph1}.

source: Your computer is enabled to work with the application for 30 days.
es: Su ordenador es habilitado para trabajar con la aplicación durante 30 días.
