Repository: oxygenxml/Fluenta
Catalog: docs/XLIFF/fluenta_*.ditamap.xlf
Languages: es

source: In {ph0}XML Options{ph1} tab of the {ph2}Preferences{ph3} dialog, select the configuration file to edit.
es: En la pestaña {ph0}Opciones XML{ph1} del cuadro de diálogo {ph2}Preferencias{ph3}, seleccione el archivo de configuración a modificar.

source: Click the {ph0}Edit Configuration File{ph1} button.
es: Haga clic en el botón {ph0}Modificar Archivo de Configuración{ph1}.

source: Use the buttons in the {ph0}Grammar Configuration{ph1} dialog to update the configuration file.
es: Utilice los botones del cuadro de diálogo {ph0}Configuración de Gramática{ph1} para actualizar el archivo de configuración.

source: Use the {ph0}Add Element{ph1} button to add a new element to the configuration file.
es: Utilice el botón {ph0}Añadir Elemento{ph1} para añadir un nuevo elemento al archivo de configuración.

source: Use the {ph0}Edit Element{ph1} button to modify the properties of an existing element.
es: Utilice el botón {ph0}Modificar Elemento{ph1} para cambiar las propiedades de un elemento existente.

source: Use the {ph0}Remove Element{ph1} button to delete an element from the configuration file.
es: Utilice el botón {ph0}Eliminar Elemento{ph1} para eliminar un elemento del archivo de configuración.

source: Repeat the previous step until all elements are properly configured.
es: Repita el paso anterior hasta que todos los elementos estén correctamente configurados.

source: Edit Memory
es: Modificar Memoria

source: Follow these steps to edit the name, source language or description of a translation memory.
es: Siga estos pasos para editar el nombre, el idioma origen o la descripción de una memoria de traducción.

source: In main menu, select {ph0} {ph1}Memories{ph2} {ph3}Edit Memory{ph4} {ph5} or click the {ph6}{ph7}Edit Memory{ph8}Edit Memory{ph9} button in {ph10}Memories{ph11} view toolbar.
es: En el menú principal, seleccione {ph0} {ph1}Memorias{ph2} {ph3}Modificar Memoria{ph4} {ph5} o haga clic en el botón {ph6}{ph7}Modificar Memoria{ph8}Modificar Memoria{ph9} de la barra de herramientas de la vista {ph10}Memorias{ph11}.

source: {ph0}Edit Memory{ph1} dialog
es: Cuadro de diálogo {ph0}Modificar Memoria{ph1}

source: Edit all fields as required.
es: Modifique todos los campos según sea necesario.

source: Click the {ph0}Update Memory{ph1} button.
es: Haga clic en el botón {ph0}Actualizar Memoria{ph1}.

source: Selected memory data is updated and the list of memories in the {ph0}Memories{ph1} view is updated to reflect the changes.
es: La memoria seleccionada se actualiza y la lista de memorias de la vista {ph0}Memorias{ph1} se actualiza para reflejar los cambios.

source: Export Memory as TMX File
es: Exportar Memoria a un Archivo TMX

source: The content of Fluenta memories can be exported in {ph0}TMX{ph1} format for exchanging with other tools or for backup purposes.
es: El contenido de las memorias de Fluenta puede exportarse en formato {ph0}TMX{ph1} para intercambiarlo con otras herramientas o para realizar copias de seguridad.

source: In {ph0}Memories{ph1} view, select the translation memory that you want to export.
es: En la vista de {ph0}Memorias{ph1}, seleccione la memoria de traducción que desea exportar.

source: In main menu, select {ph0} {ph1}Memories{ph2} {ph3}Export TMX File{ph4} {ph5} or click the {ph6}{ph7}Export TMX File{ph8}Export TMX File{ph9} button in the {ph10}Memories{ph11} view toolbar
es: En el menú principal, seleccione {ph0} {ph1}Memorias{ph2} {ph3}Exportar Archivo TMX{ph4} {ph5} o haga clic en el botón {ph6}{ph7}Exportar Archivo TMX{ph8}Exportar Archivo TMX{ph9} de la barra de herramientas en la vista {ph10}Memorias{ph11}.

source: In the file selection dialog appears, select a name and location for the TMX file that will contain the memory data.
es: En el cuadro de diálogo de selección de archivos que aparece, seleccione un nombre y una ubicación para el archivo TMX que contendrá los datos de la memoria.

source: Memory data is exported in TMX format in the selected file.
es: Los datos de la memoria son exportados en formato TMX en el archivo seleccionado.

source: Generate XLIFF
es: Generar XLIFF

source: Follow these steps to generate {ph0}XLIFF{ph1} files that you can send to your {ph2}Language Service Provider{ph3} (LSP) for translating your projects.
es: Siga estos pasos para generar archivos {ph0}XLIFF{ph1} que podrá enviar a su {ph2}Proveedor de Servicios Lingüísticos{ph3} (PSL) para que traduzca sus proyectos.

source: In {ph0}Projects{ph1} view, select the project that will be translated.
es: En la vista {ph0}Proyectos{ph1}, seleccione el proyecto a traducir.

source: In main menu, select {ph0} {ph1}Projects{ph2} {ph3}Generate XLIFF{ph4} {ph5} or click the {ph6}{ph7}Generate XLIFF{ph8}Generate XLIFF{ph9} button in the {ph10}Projects{ph11} view toolbar.
es: En el menú principal, seleccione {ph0} {ph1}Proyectos{ph2} {ph3}Crear Proyecto{ph4} {ph5} o haga clic en el botón {ph6}{ph7}Crear Proyecto{ph8}Crear Proyecto{ph9} de la barra de herramientas de la vista {ph10}Proyectos{ph11}.

source: The following dialog appears:
es: El siguiente cuadro de diálogo aparece:

source: {ph0}Generate XLIFF{ph1} dialog
es: Cuadro de diálogo {ph0}Generar XLIFF{ph1}

source: Type the name of the folder where the XLIFF files should be placed in the {ph0}XLIFF Folder{ph1} text box or use the {ph2}Browse...{ph3} button to select a folder in the file system.
es: Escriba el nombre de la carpeta donde deben generarse los archivos XLIFF en el cuadro de texto {ph0}Carpeta XLIFF{ph1} o utilice el botón {ph2}Examinar...{ph3} para seleccionar una carpeta en el sistema de archivos.

source: If you need to exclude some topics, enter the name of a DITAVAL file that you want to use for conditional processing in the {ph0}DITAVAL File{ph1} text box or use the {ph2}Browse...{ph3} button next to it to select a file from the file system.
es: Si necesita excluir algunos tópicos, introduzca el nombre de un archivo DITAVAL que desee utilizar para el procesamiento condicional en el cuadro de texto {ph0}Archivo DITAVAL{ph1} o utilice el botón {ph2}Examinar...{ph3} situado junto a él para seleccionar un archivo del sistema de archivos.

source: Select the {ph0}Reuse ICE Matches{ph1} check box if you want to compare current content with the content available last time an XLIFF file was generated and reuse all existing translations.
es: Seleccione la casilla {ph0}Reutilizar coincidencias ICE{ph1} si desea comparar el contenido actual con el contenido disponible la última vez que se generó un archivo XLIFF y reutilizar todas las traducciones existentes.

source: Select the {ph0}Modified Files Only{ph1} check box to exclude from the generated XLIFF files those topics that have not changed since the last translation cycle.
es: Seleccione la casilla {ph0}Sólo archivos modificados{ph1} para excluir de los archivos XLIFF generados aquellos temas que no hayan cambiado desde el último ciclo de traducción.

source: Select the {ph0}Use Translation Memories{ph1} check box if you want to recover translations for untranslated segments using the memories associated with the project.
es: Seleccione la casilla {ph0}Usar memorias de traducción{ph1} si desea recuperar las traducciones de los segmentos no traducidos utilizando las memorias asociadas al proyecto.

source: Select the {ph0}Paragraph Segmentation{ph1} check box if you need paragraph instead of sentence segmentation (default).
es: Seleccione la casilla {ph0}Segmentar por párrafos{ph1} si necesita segmentar por párrafos en lugar de oraciones (opción predeterminada).

source: One advantage of paragraph segmentation over sentence segmentation in translation is that it can capture more context and coherence within a text unit
es: Una de las ventajas de la segmentación por párrafos frente a la segmentación por oraciones en traducción es que permite captar más contexto y coherencia dentro de una unidad textual.

source: Select the {ph0}Generate Word Count{ph1} check box if you want a statistic analysis to be generated for each target language.
es: Seleccione la casilla {ph0}Generar estadísticas{ph1} si desea que se genere un análisis estadístico para cada idioma de destino.

source: Select the {ph0}Generate XLIFF 2.0{ph1} check box if you need to generate XLIFF 2.0 instead of XLIFF 1.2 (default).
es: Seleccione la casilla {ph0}Generar XLIFF 2.0{ph1} si necesita generar XLIFF 2.0 en lugar de XLIFF 1.2 (opción predeterminada).

source: Select the {ph0}Ignore Tracked Changes{ph1} check box to ignore tracked changes from Oxygen XML Editor, improving text segmentation.
es: Seleccione la casilla {ph0}Ignorar revisiones{ph1} para ignorar las revisiones del Editor XML Oxygen, mejorando la segmentación del texto.

source: Select the {ph0}Embed Skeleton{ph1} checkbox if you need XLIFF files that can be converted back to DITA in any computer using {ph2}OpenXLIFF Filters{ph3} or {ph4}XLIFF Manager{ph5}.
es: Seleccione la casilla {ph0}Incrustar esqueleto{ph1} si necesita archivos XLIFF que puedan convertirse de nuevo a DITA en cualquier ordenador utilizando {ph2}OpenXLIFF Filters{ph3} o {ph4}XLIFF Manager{ph5}.

source: Select the check boxes corresponding to the target languages that you want to process.
es: Seleccione las casillas correspondientes a los idiomas destino que desea procesar.

source: Click the {ph0}Generate XLIFF{ph1} button.
es: Haga clic en el botón {ph0}Generar XLIFF{ph1}.

source: Generation status is displayed in the progress panel and the {ph0}Cancel{ph1} button is enabled.
es: El estado del proceso se muestra en el panel de progreso y se activa el botón {ph0}Cancelar{ph1}.

source: An XLIFF file is generated for each selected target language. XLIFF files and optional word counts are placed in the selected XLIFF Folder.
es: Un archivo XLIFF es generado para cada uno de los idiomas destino seleccionados. Los archivos XLIFF y las estadísticas opcionales se guardan en la Carpeta XLIFF seleccionada

source: You can populate translation memories with data from {ph0}TMX{ph1} files. Use this feature if you have legacy TM data that you want to reuse in Fluenta.
es: Puede poblar las memorias de traducción con datos de archivos {ph0}TMX{ph1}. Utilice esta función si tiene datos TMX heredados que desea reutilizar en Fluenta.

source: In {ph0}Memories{ph1} view, select the translation memory that will receive the imported data.
es: En la vista de {ph0}Memorias{ph1}, seleccione la memoria de traducción que recibirá los datos a importar.

source: In main menu, select {ph0} {ph1}Memories{ph2} {ph3}Import TMX File{ph4} {ph5} or click the {ph6}{ph7}Import TMX File{ph8}Import TMX File{ph9} button in the {ph10}Memories{ph11} view toolbar.
es: En el menú principal, seleccione {ph0} {ph1}Memorias{ph2} {ph3}Importar Archivo TMX{ph4} {ph5} o haga clic en el botón {ph6}{ph7}Importar Archivo TMX{ph8}Importar Archivo TMX{ph9} de la barra de herramientas de la vista {ph10}Memorias{ph11}.

source: {ph0}Import TMX File{ph1} dialog
es: Cuadro de diálogo {ph0}Importar Archivo TMX{ph1}

source: Type the name of the TMX file to import in the {ph0}TMX File{ph1} text box or use the {ph2}Browse...{ph3} button next to it to select a TMX file from the file system.
es: Escriba el nombre del archivo TMX a importar en el cuadro de texto {ph0}Archivo TMX{ph1} o utilice el botón {ph2}Examinar...{ph3} para seleccionar un archivo TMX del sistema de archivos.

source: Click the {ph48}Import XLIFF{ph49} button. Click the {ph48}Import TMX File{ph49} button. Click the {ph0}Import TMX File{ph1} button.
es: Haga clic en el botón {ph48}Importar XLIFF{ph49}. Haga clic en el botón {ph48}Importar Archivo TMX{ph49}. Haga clic en el botón {ph0}Importar Archivo TMX{ph1}.

source: The TMX file is imported into the selected translation memory. The TMX file is imported into the selected translation memory.
es: El archivo TMX es importado en la memoria de traducción seleccionada. El archivo TMX es importado en la memoria de traducción seleccionada.

source: Import XLIFF
es: Importar XLIFF

source: Once you receive a translated {ph0}XLIFF{ph1} from your {ph2}Language Service Provider{ph3}, you need to import it into Fluenta to generate a translated version of your project.
es: Una vez que reciba un {ph0}XLIFF{ph1} traducido de su {ph2}Proveedor de Servicios Lingüísticos{ph3}, deberá importarlo a Fluenta para generar una versión traducida de su proyecto.

source: In {ph0}Projects{ph1} view, select the project that will receive the translated data.
es: En la vista {ph0}Proyectos{ph1}, seleccione el proyecto que recibirá los datos a importar.

source: In main menu, select {ph0} {ph1}Projects{ph2} {ph3}Import XLIFF{ph4} {ph5} or click the {ph6}{ph7}Import XLIFF{ph8}Import XLIFF{ph9} button in the {ph10}Projects{ph11} view toolbar.
es: En el menú principal, seleccione {ph0} {ph1}Proyectos{ph2} {ph3}Crear Proyecto{ph4} {ph5} o haga clic en el botón {ph6}{ph7}Crear Proyecto{ph8}Crear Proyecto{ph9} de la barra de herramientas de la vista {ph10}Proyectos{ph11}.

source: {ph0}Import XLIFF{ph1} dialog
es: Cuadro de diálogo {ph0}Importar XLIFF{ph1}

source: Type the name of the XLIFF file to import in the {ph0}XLIFF File{ph1} text box or use the {ph2}Browse...{ph3} button next to it to select an XLIFF file from the file system.
es: Escriba el nombre del archivo XLIFF a importar en el cuadro de texto {ph0}Archivo XLIFF{ph1} o utilice el botón {ph2}Examinar...{ph3} para seleccionar un archivo XLIFF del sistema de archivos.

source: Type the name of the folder where the translated content should be placed in the {ph0}Output Folder{ph1} text box or use the {ph2}Browse...{ph3} button to select a folder in the file system.
es: Escriba el nombre de la carpeta donde deben almacenarse las traducciones en el cuadro de texto {ph0}Carpeta Destino{ph1} o utilice el botón {ph2}Examinar...{ph3} para seleccionar una carpeta en el sistema de archivos.

source: Select the {ph0}Update Memory{ph1} check box if you want to store the imported translations in the project memory.
es: Seleccione la casilla {ph0}Actualizar memoria{ph1} si desea almacenar las traducciones importadas en la memoria del proyecto.

source: Select the{ph0} Accept Unapproved Translations{ph1} check box if the XLIFF file being imported does not have all translations marked as approved and you want to accept the existing drafts.
es: Seleccione la casilla {ph0}Aceptar traducciones no aprobadas{ph1} si el archivo XLIFF que se está importando no tiene todas las traducciones marcadas como aprobadas y desea aceptar los borradores existentes.

source: Select the {ph0}Ignore Inline Tag Errors{ph1} check box if you want to try importing an XLIFF file despite its errors with inline tags (may break the DITA content and make publication in target language impossible). If the check box is left blank and errors are found, a detailed report of errors in HTML format is automatically generated and displayed in the default browser.
es: Seleccione la casilla de verificación {ph0}Ignorar errores de etiquetas{ph1} si desea intentar importar un archivo XLIFF a pesar de sus errores con las etiquetas (el contenido DITA puede dañarse e imposibilitar la publicación en el idioma de destino). Si la casilla de verificación se deja en blanco y se encuentran errores, se genera automáticamente un informe detallado de los errores en formato HTML y se muestra en el navegador predeterminado.

source: Click the {ph0}Import XLIFF{ph1} button.
es: Haga clic en el botón {ph0}Importar XLIFF{ph1}.

source: Import status is displayed in the progress panel and the {ph0}Cancel{ph1} button is enabled.
es: El estado del proceso se muestra en el panel de progreso y se activa el botón {ph0}Cancelar{ph1}.

source: The XLIFF file is imported into the selected project. A translated version of the project content is created in the indicated output folder.
es: El archivo XLIFF se importa en el proyecto seleccionado. Se crea una versión traducida del contenido del proyecto en la carpeta de salida indicada.

source: Project Status
es: Estado del Proyecto

source: Follow these steps to check the translation status of your projects.
es: Siga estos pasos para comprobar el estado de traducción de sus proyectos.

source: In {ph0}Projects{ph1} view, select the project that you want to examine.
es: En la vista {ph0}Proyectos{ph1}, seleccione el proyecto a examinar.

source: In main menu, select {ph0} {ph1}Projects{ph2} {ph3}Project Information{ph4} {ph5} or click the {ph6}{ph7}Project Information{ph8}Project Information{ph9} button in the {ph10}Projects{ph11} view toolbar.
es: En el menú principal, seleccione {ph0} {ph1}Proyectos{ph2} {ph3}Información del Proyecto{ph4} {ph5} o haga clic en el botón {ph6}{ph7}Información del Proyecto{ph8}Información del Proyecto{ph9} de la barra de herramientas de la vista {ph10}Proyectos{ph11}.

source: {ph0}Project Information{ph1} dialog {ph2}Status{ph3} view
es: Cuadro de diálogo {ph0}Información del Proyecto{ph1}, vista {ph2}Estado{ph3}

source: You can mark one or more languages as translated by selecting the corresponding check boxes and clicking the {ph0}Mark Selection as Translated{ph1} button.
es: Puede marcar uno o más idiomas como traducidos seleccionando las casillas de verificación correspondientes y haciendo clic en el botón {ph0}Marcar Selección Como Traducida{ph1}.

source: Click the {ph0}History{ph1} tab to display a list of events associated with the project.
es: Haga clic en la pestaña {ph0}Historial{ph1} para ver una lista de eventos asociados al proyecto.

source: {ph0}Project Information{ph1} dialog, {ph2}History{ph3} view
es: Cuadro de diálogo {ph0}Información del Proyecto{ph1}, vista {ph2}Historial{ph3}

source: Register a Subscription Key
es: Registrar una Clave de Suscripción

source: When you start the program after the trial period has ended, the following dialog appears:
es: Cuando se inicia el programa después que el período de evaluación finalizó, el siguiente cuadro de diálogo aparece:

source: {ph0}Susbcription Management{ph1} dialog
es: Cuadro de diálogo {ph0}Manejo de Suscripciones{ph1}

source: Type your subscription key in the {ph0}Subscription Key{ph1} text box.
es: Ingrese su clave de suscripción en el cuadro de texto {ph0}Clave de Suscripción{ph1}.

source: If your computer uses a proxy server to connect to the Internet, follow these steps to configure the proxy server settings:
es: Si su ordenador utiliza un servidor proxy para conectarse a Internet, siga estos pasos para configurar los ajustes del servidor proxy:

source: Click the {ph0}Proxy Settings{ph1} button.
es: Haga clic en el botón {ph0}Configuración de Proxy{ph1}.

source: The following dialog appears:
es: El siguiente cuadro de diálogo aparece:

source: {ph0}Proxy Settings{ph1} dialog
es: Cuadro de diálogo {ph0}Configuración de Proxy{ph1}

source: Type the proxy server name or IP in the {ph0}Server{ph1} text box.
es: Ingrese el nombre o la IP del servidor proxy en el cuadro de texto {ph0}Servidor{ph1}.

source: Type the proxy port number in the {ph0}Port{ph1} text box.
es: Escriba el número de puerto proxy en el cuadro de texto {ph0}Puerto{ph1}.

source: If your proxy server requires authentication, type the proxy user name in the {ph0}User ID{ph1} text box and the corresponding password in the {ph2}Password{ph3} text box.
es: Si su servidor proxy requiere autenticación, escriba el nombre de usuario proxy en el cuadro de texto {ph0}Usuario{ph1} y la contraseña correspondiente en el cuadro de texto {ph2}Contraseña{ph3}.

source: Click the {ph0}Save Proxy Settings{ph1} button.
es: Haga clic en el botón {ph0}Guardar Configuración de Proxy{ph1}.

source: Selected proxy settings are saved and the dialog closes.
es: Se guardan los ajustes de proxy seleccionados y se cierra el cuadro de diálogo.

source: Click the {ph0}Register Subscription{ph1} button.
es: Haga clic en el botón {ph0}Registrar Suscripción{ph1}.

source: Your subscription key is sent to the Registration Server and your computer is enabled to work with the registered application.
es: Su clave de suscripción se envía al Servidor de Registro y su ordenador es habilitado para trabajar con la aplicación registrada.

source: Remove Configuration File
es: Eliminar Archivo de Configuración

source: In {ph0}XML Options{ph1} tab of the {ph2}Preferences{ph3} dialog, select the configuration file to remove.
es: En la pestaña {ph0}Opciones XML{ph1} del cuadro de diálogo {ph2}Preferencias{ph3}, seleccione el archivo de configuración a eliminar.

source: Click the {ph0}Remove Configuration File{ph1} button.
es: Haga clic en el botón {ph0}Eliminar Archivo de Configuración{ph1}.

source: Selected configuration file is removed and the list of configuration files is updated to reflect the change.
es: El archivo de configuración seleccionado es eliminado y la lista de archivos de configuración se actualiza para reflejar el cambio.

source: Request an Evaluation Subscription
es: Solicitar una Suscripción de Evaluación

source: You can evaluate the program for free during 30 days before purchasing a Subscription Key. All features are enabled during the evaluation period.
es: Puede evaluar el programa gratuitamente durante 30 días antes de adquirir una clave de suscripción. Todas las funciones están activadas durante el periodo de evaluación.

source: When you start the program for the first time, the following dialog appears:
es: Cuando se inicia el programa por primera vez, el siguiente cuadro de diálogo aparece:

source: {ph0}Subscription Management{ph1} dialog
es: Cuadro de diálogo {ph0}Manejo de Subscripciones{ph1}

source: Click the {ph0}Request Evaluation Key{ph1} button.
es: Haga clic en el botón {ph0}Solicitar Clave de Evaluación{ph1}.

source: The following dialog appears:
es: El siguiente cuadro de diálogo aparece:

source: {ph0}Request Evaluation Key{ph1} dialog
es: Cuadro de diálogo {ph0}Solicitar Clave de Evaluación{ph1}.

source: Type your first name in the {ph0}First Name{ph1} text box.
es: Ingrese sus nombres en el cuadro de texto {ph0}Nombres{ph1}.

source: Type your last name in the {ph0}Last Name{ph1} text box.
es: Ingrese sus apellidos en el cuadro de texto {ph0}Apellidos{ph1}.

source: Enter your company name in the {ph0}Company{ph1} text box. {ph2}This step is optional.{ph3}
es: Introduzca el nombre de su empresa en el cuadro de texto {ph0}Empresa{ph1}. {ph2}Este paso es opcional.{ph3}

source: Type your email address in the {ph0}Email{ph1} text box.
es: Escriba su dirección de correo electrónico en el cuadro de texto {ph0}Email{ph1}.

source: Enter again your email address in the {ph0}Repeat Email{ph1} text box.
es: Escriba nuevamente su dirección de correo electrónico en el cuadro de texto {ph0}Repetir Email{ph1}.

source: Click the {ph0}Request Evaluation Key{ph1} button.
es: Haga clic en el botón {ph0}Solicitar Clave de Evaluación{ph1}.

source: Your evaluation subscription request is sent to the Registration Server. An email with an evaluation subscription key will be immediately sent to the indicated email address.
es: Su solicitud de suscripción de evaluación se envía al Servidor de Registro. Se enviará un correo electrónico a la dirección indicada con una clave de suscripción de evaluación.

source: {ph0}Request Received{ph1} dialog
es: Cuadro de diálogo {ph0}Solicitud Recibida{ph1}

source: Check your email and note the new evaluation subscription key. Check your spam filter if you don't receive an email with the evaluation subscription key within a few minutes.
es: Compruebe su correo electrónico y anote la nueva clave de suscripción de evaluación. Revise su filtro de spam si no recibe un correo electrónico con la clave de suscripción de evaluación en unos minutos.
